Configuration/Documents/кплРаспределениеСуммПоПроектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>кплРаспределениеСуммПоПроектам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.кплРаспределениеСуммПоПроектам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчастникСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Проекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/CommonForms/кплФормаРаспределенияСредствПоПроектам/Ext/Form/Module.bsl
&НаСервере
Процедура РаспределитьНаСервере()
	
	Если тзПроектов.Итог("Сумма") = 0 тогда
		Возврат;
	КонецЕсли;
	
	ДокументРаспределения = Документы.кплРаспределениеСуммПоПроектам.СоздатьДокумент();
	ДокументРаспределения.Дата = ТекущаяДата();
	ДокументРаспределения.УчастникСделки = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	
	Для Каждого СтрокаРешения Из тзПроектов Цикл
		Если СтрокаРешения.Сумма > 0 Тогда
			НоваяСтрока = ДокументРаспределения.Проекты.Добавить();
			НоваяСтрока.Проект	 = СтрокаРешения.Проект;
			НоваяСтрока.Сумма	 = СтрокаРешения.Сумма;
		КонецЕсли;
	КонецЦикла;
	//УстановитьПривилегированныйРежим(Истина);
	Попытка
		ДокументРаспределения.Записать(РежимЗаписиДокумента.Запись);
		ДокументРаспределения.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Проекты.Ответственный КАК Ответственный,
	|	Проекты.Ссылка КАК Проект,
	|	0 КАК Сумма
	|ИЗ
	|	Справочник.Проекты КАК Проекты";
	
	//Запрос.УстановитьПараметр("", );
	
	Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	
	тзПроектов.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры
